{
  "world_news": [
    {
      "name": "Enviroment",
      "data": {
        "Massachusetts lifts critical drought status after above-normal rain": "State environmental officials have lifted the more critical drought status, although eastern parts of the state are still experiencing rainfall deficits.",
        "Pakistan's Urgent Water Crisis: Government and Judiciary Act": "Facing severe drought threats, Pakistan's government prioritizes water storage and clean energy projects, while the Lahore High Court enforces strict measures on water wastage. Key projects like the Diamer-Basha Dam aim to double hydel capacity by 2030, offering economic and environmental benefits.",
        "Designs for Manitoba flood prevention project to be completed this spring: minister": "WINNIPEG - The Manitoba government expects new designs of a long-promised flood prevention project will be completed later this year after the province asked the federal government to pause environmental",
        "Pink paint slashed on U.S. Embassy in Ottawa as part of protest": "A protester sprayed pink paint on the U.S. Embassy in Ottawa Thursday, as part of a campaign by an environmental group calling for the creation of a “climate disaster protection agency” funded by the “ultra-rich.”",
        "Destruction of Ukraine dam caused ‘toxic timebomb’ of heavy metals, study finds": "Researchers say environmental impact from Kakhovka dam explosion comparable to Chornobyl nuclear disaster",
        "As countries scramble for minerals, the seabed beckons. Will mining it be a disaster? - visual explainer": "Mining companies are poised to mine the deep sea – but opposition is growing. What is the environmental cost, and are these metals actually needed?",
        "How bad could the North Sea tanker collision be for the environment?": "An environmental group in the U.K. says the North Sea tanker collision could become a \"disaster in really important protected areas.\"",
        "Fires continue to burn after ships collide off coast of England, stoking environmental concerns": "There are growing concerns that the jet fuel carried by one of the ships and the toxic chemicals aboard the other could cause an environmental disaster",
        "North Sea collision has raised fears of an environmental disaster. Here’s what we know": "Fears are mounting of a potential environmental disaster off the coast of Britain after a cargo ship smashed into an oil tanker transporting jet fuel for the US military.",
        "Environmental disaster as salmon die en masse in Tasmania": "Ebony Bennett: Mass salmon die-off in Tasmania threatens environment. Foreign-owned companies evade taxes while harming local ecology."
      }
    },
    {
      "name": "Global",
      "data": {
        "Dominican club collapse death toll rises to 226 after woman pulled from rubble dies in hospital": "A woman hospitalised after being rescued from the rubble of a roof collapse at a popular nightclub in the D...",
        "Australian student injured in West Bank still seeking answers months after alleged shooting": "Australian citizen Ranem Abu-Izneid lost sight in one eye after being struck by shrapnel while studying in her university accommodation in the West Bank. She says five months on from the incident, she's no closer to getting any accountability.",
        "Sudan Clinic Workers Killed in Zamzam Camp": "Relief International said nine employees were killed when gunmen stormed the Zamzam camp in El Fasher, in the western Darfur region.",
        "What to Know About U.S. Talks With Iran Over Its Nuclear Program": "The two sides held preliminary negotiations on Saturday, and an Iranian official said they would resume next week.",
        "Erdoğan lambasts Israel for undermining stability in Syria": "Turkey’s president lashes out shortly after talks with Netanyahu’s government aimed at defusing tensions",
        "The moment I knew: he bared his soul in a performance, and I fell for his sensitive side": "When Mitch launched into a piano recital at his birthday party, his friends were gobsmacked by his hidden talent. Eoin O’Dwyer knew he was the man he had to marry",
        "UN: Gaza faces famine as 60,000 children go hungry amid supply cuts": "The death toll in Gaza has surpassed 50,900, with most victims being women and children, say Palestinian authorities",
        "Trump's changing tariffs causes panic buying and paralysis": "The rapid change of Trump's tariff policy has shoppers wondering if they should stock up or just wait this out.",
        "What does the dire wolf 'de-extinction' mean for bringing back Tasmanian tigers?": "There was a lot of hype about an American company's announcement about ancient dire wolves. It raises questions about the bid to \"bring back\" the Tasmanian tiger.",
        "The tourism boom in Niseko is good for business but has made housing unaffordable for locals": "International tourists, especially Australians, started to arrive en masse in the famous Japanese ski resort of Niseko in the early 2000s. Now the influx has pushed the cost of housing so high it's almost impossible for locals to compete with wealthy foreigners for property."
      }
    },
    {
      "name": "Local",
      "data": {
        "Connecticut cop found dead by suicide hours after he’s busted for enticing a minor": "Officers from the Manchester Police Department arrested Sgt. Ryan Moan, 33, of Coventry, on Friday and slapped him with a handful of charges, including enticing a minor by computer.",
        "Manchester, CT cop found dead hours after being arrested": "A Connecticut cop was found dead on Friday, hours after he was arrested by his own police department and charged with enticing a minor and related crimes.",
        "Manchester's Matt Remillard Named To Connecticut Boxing Hall": "Manchester's Matt Remillard Named To Connecticut Boxing Hall - Manchester, CT - The Connecticut Boxing Hall of Fame induction gala is set to return to the Uncas Ballroom at Mohegan Sun on Nov. 18.",
        "Aer Lingus Swaps The Airbus A321LR For The A330 Between Manchester & New York": "The airline will redeploy the narrowbody aircraft on its transatlantic routes from Dublin to Hartford, Connecticut, and Cleveland, Ohio",
        "Recovery Connection Centers Set To Enter Connecticut - In Manchester": "Recovery Connection Centers Set To Enter Connecticut — In Manchester - Manchester, CT - A company that bills itself as \"the leading Suboxone treatment organization\" is poised to enter Connecticut.",
        "Watch: Connecticut teacher rescues unconscious driver from burning car": "Manchester Fire Rescue EMS says Heather Sica Leonard, a teacher at Illing Middle School in Manchester, almost certainly saved the driver’s life.",
        "Middle school teacher pulls driver with physical disability from burning van": "A Manchester middle school teacher saved a driver with a physical disability from a car fire, Connecticut police said.",
        "Manchester Road Race 2022: Division Winners, Area Town Bragging Rights": "Manchester Road Race 2022: Division Winners, Area Town Bragging Rights - Across Connecticut, CT - Division winners of the 86th Manchester Road Race, plus the first male and female finishers from Hartford and Tolland County Patch towns.",
        "State Police Dispatcher Caught In Manchester Drug Sting, Now On Leave": "State Police Dispatcher Caught In Manchester Drug Sting, Now On Leave - Manchester, CT - A dispatcher for the Connecticut State Police was arrested in a drug sting in Manchester, authorities said.",
        "August Air Conditioner Search - Which North Central CT Town Had It?": "August Air Conditioner Search — Which North Central CT Town Had It? - Manchester, CT - The search was on Tuesday for a particular air conditioning unit in north central Connecticut."
      }
    }
  ]
}