{
  "world_news": [
    {
      "name": "Environment",
      "data": {
        "Massachusetts lifts critical drought status after above-normal rain": "State environmental officials have lifted the more critical drought status, although eastern parts of the state are still experiencing rainfall deficits.",
        "Pakistan's Urgent Water Crisis: Government and Judiciary Act": "Facing severe drought threats, Pakistan's government prioritizes water storage and clean energy projects, while the Lahore High Court enforces strict measures on water wastage. Key projects like the Diamer-Basha Dam aim to double hydel capacity by 2030, offering economic and environmental benefits.",
        "Designs for Manitoba flood prevention project to be completed this spring: minister": "WINNIPEG - The Manitoba government expects new designs of a long-promised flood prevention project will be completed later this year after the province asked the federal government to pause environmental",
        "Pink paint slashed on U.S. Embassy in Ottawa as part of protest": "A protester sprayed pink paint on the U.S. Embassy in Ottawa Thursday, as part of a campaign by an environmental group calling for the creation of a “climate disaster protection agency” funded by the “ultra-rich.”",
        "Destruction of Ukraine dam caused ‘toxic timebomb’ of heavy metals, study finds": "Researchers say environmental impact from Kakhovka dam explosion comparable to Chornobyl nuclear disaster",
        "As countries scramble for minerals, the seabed beckons. Will mining it be a disaster? - visual explainer": "Mining companies are poised to mine the deep sea – but opposition is growing. What is the environmental cost, and are these metals actually needed?",
        "How bad could the North Sea tanker collision be for the environment?": "An environmental group in the U.K. says the North Sea tanker collision could become a \"disaster in really important protected areas.\"",
        "Fires continue to burn after ships collide off coast of England, stoking environmental concerns": "There are growing concerns that the jet fuel carried by one of the ships and the toxic chemicals aboard the other could cause an environmental disaster",
        "North Sea collision has raised fears of an environmental disaster. Here’s what we know": "Fears are mounting of a potential environmental disaster off the coast of Britain after a cargo ship smashed into an oil tanker transporting jet fuel for the US military.",
        "Environmental disaster as salmon die en masse in Tasmania": "Ebony Bennett: Mass salmon die-off in Tasmania threatens environment. Foreign-owned companies evade taxes while harming local ecology."
      }
    },
    {
      "name": "Global",
      "data": {
        "US man shot dead after hijacking small passenger plane in Belize": "Two people injured after man took control of plane at knifepoint before being shot by another passenger",
        "Menendez brothers' resentencing on hold until May": "A hearing set to decide the fate of the convicted killers was delayed after bickering in court.",
        "Knife-wielding US citizen hijacks plane in Belize, shot dead by passenger mid-air": "Akinyela Sawa Taylor pulled a knife while the plane was in the air, demanding that the domestic flight take him out of the country. | World News",
        "Israel-Gaza war: Hamas formally rejects latest ceasefire offer": "The group says it wants a deal that would free all hostages in return for an end to the war.",
        "Hamas formally rejects latest ceasefire offer": "The group says it wants a deal that would free all hostages in return for an end to the war.",
        "Ukraine war briefing: China arming Russia and building weapons on its soil, says Zelenskyy": "Just as much Russian bombing under energy ceasefire, says Ukrainian president. What we know on day 1,150",
        "A look at why an island-wide blackout hit Puerto Rico and what caused it": "An island-wide blackout hit Puerto Rico this week, leaving 1.4 million customers without power and more than 400,000 without water.",
        "Could taking carbon out of the sea cool down the planet?": "A pilot project will test whether it is a useful way of fighting climate change.",
        "How much do bin workers get paid?": "At the heart of the dispute are the Waste Recycling and Collection Officers, who were paid more than some other bin workers.",
        "Syrians have more freedom after Assad, but could they lose it?": "There are concerns around what democracy could look like and the role of Islam in the new regime."
      }
    },
    {
      "name": "Local",
      "data": {
        "Connecticut cop found dead by suicide hours after he’s busted for enticing a minor": "Officers from the Manchester Police Department arrested Sgt. Ryan Moan, 33, of Coventry, on Friday and slapped him with a handful of charges, including enticing a minor by computer.",
        "Manchester, CT cop found dead hours after being arrested": "A Connecticut cop was found dead on Friday, hours after he was arrested by his own police department and charged with enticing a minor and related crimes.",
        "Manchester's Matt Remillard Named To Connecticut Boxing Hall": "Manchester's Matt Remillard Named To Connecticut Boxing Hall - Manchester, CT - The Connecticut Boxing Hall of Fame induction gala is set to return to the Uncas Ballroom at Mohegan Sun on Nov. 18.",
        "Aer Lingus Swaps The Airbus A321LR For The A330 Between Manchester & New York": "The airline will redeploy the narrowbody aircraft on its transatlantic routes from Dublin to Hartford, Connecticut, and Cleveland, Ohio",
        "Recovery Connection Centers Set To Enter Connecticut - In Manchester": "Recovery Connection Centers Set To Enter Connecticut — In Manchester - Manchester, CT - A company that bills itself as \"the leading Suboxone treatment organization\" is poised to enter Connecticut.",
        "Watch: Connecticut teacher rescues unconscious driver from burning car": "Manchester Fire Rescue EMS says Heather Sica Leonard, a teacher at Illing Middle School in Manchester, almost certainly saved the driver’s life.",
        "Middle school teacher pulls driver with physical disability from burning van": "A Manchester middle school teacher saved a driver with a physical disability from a car fire, Connecticut police said.",
        "Manchester Road Race 2022: Division Winners, Area Town Bragging Rights": "Manchester Road Race 2022: Division Winners, Area Town Bragging Rights - Across Connecticut, CT - Division winners of the 86th Manchester Road Race, plus the first male and female finishers from Hartford and Tolland County Patch towns.",
        "State Police Dispatcher Caught In Manchester Drug Sting, Now On Leave": "State Police Dispatcher Caught In Manchester Drug Sting, Now On Leave - Manchester, CT - A dispatcher for the Connecticut State Police was arrested in a drug sting in Manchester, authorities said.",
        "August Air Conditioner Search - Which North Central CT Town Had It?": "August Air Conditioner Search — Which North Central CT Town Had It? - Manchester, CT - The search was on Tuesday for a particular air conditioning unit in north central Connecticut."
      }
    }
  ],
  "tech_news": [
    {
      "name": "Cloud",
      "data": {
        "Trump’s new energy order puts states’ climate laws in the crosshairs of the Department of Justice": "President Trump’s order comes as US electricity demand ramps up to meet the growth of artificial intelligence and cloud computing applications, as well as federal efforts to expand high-tech manufacturing.",
        "Axiom Space to launch orbital data centers on Kepler satellites": "Axiom Space will fly two data centers on Kepler Communications satellites as the next step of its efforts to develop space-based cloud computing services.",
        "Coal-fired power plant, now retired, to become massive gas-powered campus for AI, data centers": "HARRISBURG, Pa. (AP) — The owners of what was once Pennsylvania's biggest coal-fired power plant said Wednesday that they will turn it into a $10 billion natural gas-powered data center campus designed to capitalize on the fast-growing energy demands of Big Tech companies to power artificial intelligence and cloud computing applications.",
        "Does CoreWeave's disappointing IPO signal an AI bubble?": "Nvidia-backed AI and cloud computing company CoreWeave made its market debut on Friday to little applause",
        "Super Micro could become the world's largest server vendor by the end of the year as it experiences meteoric rise": "Hyperscalers dominate server sales, reinforcing cloud computing’s growing influence",
        "Wired for wellness: How IoMT is rebooting global healthcare": "Devices such as smartwatches, biosensors, and implantable monitors are now routinely used to track blood pressure, glucose levels, heart rate, and more. The health data generated by these devices can be processed through cloud computing and artificial intelligence platforms to support diagnostics, treatment decisions, and patient management.",
        "Microsoft posts weekly gain to end longest losing streak since 2008": "Microsoft faces competition in cloud computing from companies such as Google, which is looking to boost its security business with Wiz.",
        "Singapore 'gravely concerned' about resumption of hostilities in Gaza; Oracle to provide MINDEF, SAF with cloud computing, AI services: Singapore live news": "Yahoo Singapore is featuring a curated selection of some of the biggest, most important, and fascinating news that's making waves online.",
        "Why Google made a $32 billion bet on Wiz": "Google has announced its acquiring Wiz for $32 billion, a move that could help the company close the gap with Amazon and Microsoft’s cloud computing businesses.",
        "Google to buy cybersecurity firm Wiz for $32 billion in biggest deal in company's history": "The proposed takeover is part of Google's aggressive expansion into cloud computing during an artificial intelligence boom"
      }
    },
    {
      "name": "Coding",
      "data": {
        "Google launches Firebase Studio, a free AI coding tool and alternative to Cursor, Bolt, and v0 for building full-stack apps": "Google just shook up the developer tool space with something that’s bound to get attention: Firebase Studio — a browser-based, AI-driven development environment that’s free and feels like it was made to challenge tools like Cursor, Bolt, and v0 head-on. Announced Wednesday at Google Cloud Next, Firebase Studio isn’t just another dev tool. It’s a",
        "Vibe coding at enterprise scale: AI tools now tackle the full development lifecycle": "Enterprise AI application development is moving forward with a new generation of vibe coding tools.",
        "From Software's Switch 2 Exclusive Was Originally Pitched For The Original Switch": "The From Software title exclusive to Switch 2 started development for its predecessor.",
        "Devin 2.0 is here: Cognition slashes price of AI software engineer to $20 per month from $500": "Devin attracted interest from enterprise customers seeking to incorporate autonomous coding agents into their software development processes.",
        "The Best Way to Work with ORM in .NET: A Practical Guide for Developers": "Ever wondered what ORM in .NET is and why developers rave about it? ORM, or Object-Relational Mapping, is a game-changer in modern software development, especially within the .NET Framework. It bridges the gap between the object model used in C# applications and the relational database that stores persistent data. Introduced to simplify data access layers,",
        "Is AI set to take over coding? Unpacking the debate over jobs, future of software development": "Amid concerns about the impact of AI on coding, Anthropic CEO Dario Amodei recently made a proclamation that left many rattled.",
        "IT titans at war: Cognizant denies slow-roll plot by its CEO to hurt Infosys": "New Jersey-headquartered Cognizant labelled “preposterous” Infosys’s allegations that the former had hired current chief executive officer S. Ravi Kumar to slow down the development of Infosys’s healthcare software product (Helix).",
        "SiFive HiFive Premier P550 Review: A True RISC-V Dev Kit Platform Emerges": "SiFive's latest development kit makes running RISC-V software a reality on real silicon while sporting lots of IO.",
        "Exploring the relationship between non-coding RNAs and oxidative stress in cancer progression": "A new review article published in Genes & Diseases explores the intricate relationship between non-coding RNAs and oxidative stress in cancer progression shedding new light on the mechanisms that drive tumor development.",
        "Will the future of software development run on vibes?": "Accepting AI-written code without understanding how it works is growing in popularity."
      }
    },
    {
      "name": "Hardware",
      "data": {
        "I am thrilled by Nvidia’s cute petaflop mini PC wonder, and it’s time for Jensen’s law: it takes 100 months to get equal AI performance for 1/25th of the cost": "Nvidia’s desktop super computer is probably the greatest revolution in tech hardware since the IBM PC",
        "Switch 2 leaks point to controllers that work like computer mice": "Circumstantial rumors suggest a new hybrid hardware gimmick might be in the works.",
        "Microsoft develops GreenSKU framework to limit environmental cost of server hardware": "Ashkitha Sriraman, a computer science professor at Carnegie Mellon that is involved in the program, notes that it is not uncommon for an entire server to be...",
        "Want to save your old computer? Try these 6 Linux distros": "Here's how to save money, reduce e-waste, and extend the life of your old hardware at the same time.",
        "Today in Apple history: Too little, too late for Apple III": "On December 1, 1981, the Apple III relaunch addressed the computer's biggest hardware faults as the company did damage control.",
        "Don't be misled by retailers this Black Friday: Double-check for these AI specs on any Windows 11 Copilot+ PC": "If you plan to buy a Copilot+ PC during Black Friday or Cyber Monday, be aware that some retailers may try to deceive you into buying something that's not. In this guide, I will outline the hardware specifications you have to look for to make sure you're getting a truly AI-powered computer.",
        "Super Micro Computer stock soars 30% as it avoids Nasdaq de-listing": "The AI hardware company hired a new auditor and submitted a detailed compliance plan to the Nasdaq",
        "Super Micro Computer stock craters. Will it get delisted by Nasdaq?": "The AI-focused hardware company has just two days to submit a plan to Nasdaq to stay in compliance",
        "Super Micro Computer stock bleeds as it can't say when earnings will post": "Shares of the AI hardware maker hit a new 52-week low after it reported unaudited quarterly results because its auditor quit",
        "Where Will Super Micro Computer Stock Be in 1 Year?": "Can the hardware maker recover from this latest crisis?"
      }
    }
  ],
  "travel_news": [
    {
      "name": "Advisory",
      "data": {
        "Greenland Travel Advisory": "Level 2: Exercise Increased Caution",
        "Burma (Myanmar) Travel Advisory": "Level 4: Do Not Travel",
        "Afghanistan Travel Advisory": "Level 4: Do Not Travel",
        "Albania Travel Advisory": "Level 2: Exercise Increased Caution",
        "Algeria Travel Advisory": "Level 2: Exercise Increased Caution",
        "Angola Travel Advisory": "Level 2: Exercise Increased Caution",
        "Antarctica Travel Advisory": "Level 2: Exercise Increased Caution",
        "Botswana Travel Advisory": "Level 2: Exercise Increased Caution",
        "Comoros Travel Advisory": "Level 2: Exercise Increased Caution",
        "Djibouti Travel Advisory": "Level 2: Exercise Increased Caution",
        "Equatorial Guinea Travel Advisory": "Level 2: Exercise Increased Caution",
        "Guinea Travel Advisory": "Level 2: Exercise Increased Caution",
        "Lesotho Travel Advisory": "Level 2: Exercise Increased Caution",
        "Namibia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Eswatini Travel Advisory": "Level 2: Exercise Increased Caution",
        "Hong Kong Travel Advisory": "Level 2: Exercise Increased Caution",
        "Macau Travel Advisory": "Level 3: Reconsider Travel",
        "New Caledonia Travel Advisory": "Level 3: Reconsider Travel",
        "Papua New Guinea Travel Advisory": "Level 3: Reconsider Travel",
        "Belarus Travel Advisory": "Level 4: Do Not Travel",
        "Belgium Travel Advisory": "Level 2: Exercise Increased Caution",
        "Denmark Travel Advisory": "Level 2: Exercise Increased Caution",
        "France Travel Advisory": "Level 2: Exercise Increased Caution",
        "Germany Travel Advisory": "Level 2: Exercise Increased Caution",
        "Netherlands Travel Advisory": "Level 2: Exercise Increased Caution",
        "Serbia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Spain Travel Advisory": "Level 2: Exercise Increased Caution",
        "Sweden Travel Advisory": "Level 2: Exercise Increased Caution",
        "United Kingdom Travel Advisory": "Level 2: Exercise Increased Caution",
        "United Arab Emirates Travel Advisory": "Level 2: Exercise Increased Caution",
        "Belize Travel Advisory": "Level 2: Exercise Increased Caution",
        "Brazil Travel Advisory": "Level 2: Exercise Increased Caution",
        "Trinidad and Tobago Travel Advisory": "Level 3: Reconsider Travel",
        "South Sudan Travel Advisory": "Level 4: Do Not Travel",
        "Turks and Caicos Islands Travel Advisory": "Level 2: Exercise Increased Caution",
        "Guatemala Travel Advisory": "Level 3: Reconsider Travel",
        "Guyana Travel Advisory": "Level 3: Reconsider Travel",
        "Haiti Travel Advisory": "Level 4: Do Not Travel",
        "Honduras Travel Advisory": "Level 3: Reconsider Travel",
        "India Travel Advisory": "Level 2: Exercise Increased Caution",
        "Indonesia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Iran Travel Advisory": "Level 4: Do Not Travel",
        "Iraq Travel Advisory": "Level 4: Do Not Travel",
        "Italy Travel Advisory": "Level 2: Exercise Increased Caution",
        "Jamaica Travel Advisory": "Level 3: Reconsider Travel",
        "Jordan Travel Advisory": "Level 2: Exercise Increased Caution",
        "Kenya Travel Advisory": "Level 2: Exercise Increased Caution",
        "North Korea (Democratic People's Republic of Korea) Travel Advisory": "Level 4: Do Not Travel",
        "Kosovo Travel Advisory": "Level 2: Exercise Increased Caution",
        "Laos Travel Advisory": "Level 2: Exercise Increased Caution",
        "Lebanon Travel Advisory": "Level 4: Do Not Travel",
        "Liberia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Libya Travel Advisory": "Level 4: Do Not Travel",
        "Madagascar Travel Advisory": "Level 2: Exercise Increased Caution",
        "Malawi Travel Advisory": "Level 2: Exercise Increased Caution",
        "Maldives Travel Advisory": "Level 2: Exercise Increased Caution",
        "Mali Travel Advisory": "Level 4: Do Not Travel",
        "Mauritania Travel Advisory": "Level 3: Reconsider Travel",
        "Moldova Travel Advisory": "Level 2: Exercise Increased Caution",
        "Morocco Travel Advisory": "Level 2: Exercise Increased Caution",
        "Mozambique Travel Advisory": "Level 3: Reconsider Travel",
        "Nepal Travel Advisory": "Level 2: Exercise Increased Caution",
        "Nicaragua Travel Advisory": "Level 3: Reconsider Travel",
        "Niger Travel Advisory": "Level 3: Reconsider Travel",
        "Nigeria Travel Advisory": "Level 3: Reconsider Travel",
        "Oman Travel Advisory": "Level 2: Exercise Increased Caution",
        "Pakistan Travel Advisory": "Level 3: Reconsider Travel",
        "Panama Travel Advisory": "Level 2: Exercise Increased Caution",
        "Peru Travel Advisory": "Level 2: Exercise Increased Caution",
        "Philippines Travel Advisory": "Level 2: Exercise Increased Caution",
        "Russia Travel Advisory": "Level 4: Do Not Travel",
        "Rwanda Travel Advisory": "Level 2: Exercise Increased Caution",
        "Saudi Arabia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Sierra Leone Travel Advisory": "Level 2: Exercise Increased Caution",
        "Solomon Island Travel Advisory": "Level 2: Exercise Increased Caution",
        "Somalia Travel Advisory": "Level 4: Do Not Travel",
        "South Africa Travel Advisory": "Level 2: Exercise Increased Caution",
        "Sri Lanka Travel Advisory": "Level 2: Exercise Increased Caution",
        "Sudan Travel Advisory": "Level 4: Do Not Travel",
        "Syria Travel Advisory": "Level 4: Do Not Travel",
        "Tajikistan Travel Advisory": "Level 2: Exercise Increased Caution",
        "Tanzania Travel Advisory": "Level 2: Exercise Increased Caution",
        "Timor-Leste Travel Advisory": "Level 2: Exercise Increased Caution",
        "Togo Travel Advisory": "Level 2: Exercise Increased Caution",
        "Tunisia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Turkey Travel Advisory": "Level 2: Exercise Increased Caution",
        "Uganda Travel Advisory": "Level 3: Reconsider Travel",
        "Ukraine Travel Advisory": "Level 4: Do Not Travel",
        "Uruguay Travel Advisory": "Level 2: Exercise Increased Caution",
        "Vanuatu Travel Advisory": "Level 3: Reconsider Travel",
        "Venezuela Travel Advisory": "Level 4: Do Not Travel",
        "Yemen Travel Advisory": "Level 4: Do Not Travel",
        "Zimbabwe Travel Advisory": "Level 2: Exercise Increased Caution",
        "Armenia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Azerbaijan Travel Advisory": "Level 2: Exercise Increased Caution",
        "The Bahamas Travel Advisory": "Level 2: Exercise Increased Caution",
        "Bahrain Travel Advisory": "Level 2: Exercise Increased Caution",
        "Bangladesh Travel Advisory": "Level 3: Reconsider Travel",
        "Benin Travel Advisory": "Level 2: Exercise Increased Caution",
        "Bolivia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Bosnia and Herzegovina Travel Advisory": "Level 2: Exercise Increased Caution",
        "Burkina Faso Travel Advisory": "Level 4: Do Not Travel",
        "Burundi Travel Advisory": "Level 3: Reconsider Travel",
        "Cameroon Travel Advisory": "Level 2: Exercise Increased Caution",
        "Central African Republic Travel Advisory": "Level 4: Do Not Travel",
        "Chad Travel Advisory": "Level 3: Reconsider Travel",
        "Chile Travel Advisory": "Level 2: Exercise Increased Caution",
        "China Travel Advisory": "Level 2: Exercise Increased Caution",
        "Colombia Travel Advisory": "Level 3: Reconsider Travel",
        "Costa Rica Travel Advisory": "Level 2: Exercise Increased Caution",
        "Cote d'Ivoire Travel Advisory": "Level 2: Exercise Increased Caution",
        "Cuba Travel Advisory": "Level 2: Exercise Increased Caution",
        "Dominican Republic Travel Advisory": "Level 2: Exercise Increased Caution",
        "Ecuador Travel Advisory": "Level 2: Exercise Increased Caution",
        "Egypt Travel Advisory": "Level 3: Reconsider Travel",
        "Eritrea Travel Advisory": "Level 2: Exercise Increased Caution",
        "Ethiopia Travel Advisory": "Level 3: Reconsider Travel",
        "Gabon Travel Advisory": "Level 2: Exercise Increased Caution",
        "The Gambia Travel Advisory": "Level 2: Exercise Increased Caution",
        "Ghana Travel Advisory": "Level 2: Exercise Increased Caution",
        "Democratic Republic of the Congo Travel Advisory": "Level 4: Do Not Travel",
        "Republic of the Congo Travel Advisory": "Level 2: Exercise Increased Caution",
        "Guinea-Bissau Travel Advisory": "Level 3: Reconsider Travel"
      }
    },
    {
      "name": "Germany",
      "data": {
        "Jan. 1": "New Year’s Day (Neujahrstag)",
        "Jan. 6": "Epiphany (Heilige Drei Könige)",
        "Mar. 8": "International Women’s Day",
        "Apr. 18": "Good Friday (Karfreitag)",
        "Apr. 21": "Easter Monday (Ostermontag)",
        "May 1": "Labor Day (Maifeiertag)",
        "May 29": "Ascension Day (Christi Himmelfahrt)",
        "Jun. 9": "Whit Monday (Pfingstmontag)",
        "Jun. 19": "Corpus Christi Day (Fronleichnam)",
        "Aug. 15": "Assumption Day (Maria Himmelfahrt)",
        "Sep. 20": "World Children’s Day",
        "Oct. 3": "Day of German Unity (Tag der Deutschen Einheit)",
        "Oct. 31": "Reformation Day (Reformationstag)",
        "Nov. 1": "All Saints Day (Allerheiligen)",
        "Nov. 19": "Repentance Day (Buß- und Bettag)",
        "Dec. 25": "Christmas (1. Weihnachtstag)",
        "Dec. 26": "2nd Christmas Day (2. Weihnachtstag)",
        "Apr. 3": "Good Friday (Karfreitag)",
        "Apr. 6": "Easter Monday (Ostermontag)",
        "May 14": "Ascension Day (Christi Himmelfahrt)",
        "May 25": "Whit Monday (Pfingstmontag)",
        "Jun. 4": "Corpus Christi Day (Fronleichnam)",
        "Nov. 18": "Repentance Day (Buß- und Bettag)"
      }
    },
    {
      "name": "Japan",
      "data": {
        "From April 29 to 5 May": "Japanese Golden Week",
        "May 11": "Mother's Day in Japan",
        "June 6": "Beginning of the rainy season (Tsuyu) in Japan",
        "June 21": "Summer starts in Japan",
        "From July 1 to 31": "Gion Matsuri Festival in Kyoto with float processions on July 17 and 24",
        "July 1": "Season start for climbing Mount Fuji",
        "July 17": "On July 17, 1868, Edo was renamed Tokyo.",
        "July 19": "End of rainy season (Tsuyu) in Japan",
        "July 21": "Sea day / Umi no Hi in Japan (holiday)",
        "From July 24 to 25": "Tenjin Matsuri Festival in Osaka"
      }
    }
  ]
}