{
  "world_news": [
    {
      "name": "Enviroment",
      "data": {
        "Massachusetts lifts critical drought status after above-normal rain": "State environmental officials have lifted the more critical drought status, although eastern parts of the state are still experiencing rainfall deficits.",
        "Pakistan's Urgent Water Crisis: Government and Judiciary Act": "Facing severe drought threats, Pakistan's government prioritizes water storage and clean energy projects, while the Lahore High Court enforces strict measures on water wastage. Key projects like the Diamer-Basha Dam aim to double hydel capacity by 2030, offering economic and environmental benefits.",
        "Designs for Manitoba flood prevention project to be completed this spring: minister": "WINNIPEG - The Manitoba government expects new designs of a long-promised flood prevention project will be completed later this year after the province asked the federal government to pause environmental",
        "Pink paint slashed on U.S. Embassy in Ottawa as part of protest": "A protester sprayed pink paint on the U.S. Embassy in Ottawa Thursday, as part of a campaign by an environmental group calling for the creation of a “climate disaster protection agency” funded by the “ultra-rich.”",
        "Destruction of Ukraine dam caused ‘toxic timebomb’ of heavy metals, study finds": "Researchers say environmental impact from Kakhovka dam explosion comparable to Chornobyl nuclear disaster",
        "As countries scramble for minerals, the seabed beckons. Will mining it be a disaster? - visual explainer": "Mining companies are poised to mine the deep sea – but opposition is growing. What is the environmental cost, and are these metals actually needed?",
        "How bad could the North Sea tanker collision be for the environment?": "An environmental group in the U.K. says the North Sea tanker collision could become a \"disaster in really important protected areas.\"",
        "Fires continue to burn after ships collide off coast of England, stoking environmental concerns": "There are growing concerns that the jet fuel carried by one of the ships and the toxic chemicals aboard the other could cause an environmental disaster",
        "North Sea collision has raised fears of an environmental disaster. Here’s what we know": "Fears are mounting of a potential environmental disaster off the coast of Britain after a cargo ship smashed into an oil tanker transporting jet fuel for the US military.",
        "Environmental disaster as salmon die en masse in Tasmania": "Ebony Bennett: Mass salmon die-off in Tasmania threatens environment. Foreign-owned companies evade taxes while harming local ecology."
      }
    },
    {
      "name": "Global",
      "data": {
        "Palestinian medic attacked in Gaza is being detained in Israel, says ICRC": "Palestinian Red Crescent says Assad al-Nsasrah was ‘forcibly abducted’ while carrying out humanitarian work",
        "Japan’s ‘Baba Vanga’ predicts mega-tsunami for July 2025-should we be concerned": "Zodiacs & Astrology News: Ryo Tatsuki, dubbed the 'Baba Vanga of Japan,' has predicted a mega-tsunami in July 2025, sparking global concern. Known for her past accurate prophec",
        "Xi Jinping seeks to strengthen economic ties during tour of south-east Asia": "President’s first stop is Vietnam as China urges US to end trade war and return to ‘right path of mutual respect’",
        "Gabon military leader Brice Oligui Nguema wins presidential election": "Head of caretaker government and leader of 2023 coup wins presidential race, according to provisional results.",
        "Trump admin to declare separate tariffs for exempted electronics, semiconductors": "On Friday, the Trump administration had granted exclusions from tariffs on some electronic products and semi conductors.",
        "Pennsylvania governor evacuated from suspected arson attack on home": "Authorities say the fire caused \"a significant amount of damage to a portion of the residence\" in the state capital.",
        "Pope defies doctors and greets crowds in Vatican square": "Pope Francis delighted Catholic worshippers with an impromptu tour of St Peter's Square at the end of a Palm Sunday service, against the advice of his doctors to avoid crowds while recovering from pneumonia.",
        "Donald Trump undergoes first medical exam since White House return: 5 key points": "US News: The White House announced President Trump is \"fully fit\" following his first medical check-up of his second term. The examination, conducted by Capt.",
        "Pharmaceuticals 'need to be made in America' says US Commerce Secretary after temporary tariff halt": "The Trump Administration has not yet targeted the pharmaceutical sector with its wide-ranging tariffs.",
        "China’s defiance explained: Why Xi doesn’t fear Trump’s trade war": "Instead of conceding to US traffic pressure, Beijing has pursued an alternative strategy, prioritizing internal reforms and expanding its economic partnerships globally."
      }
    },
    {
      "name": "Local",
      "data": {
        "Connecticut cop found dead by suicide hours after he’s busted for enticing a minor": "Officers from the Manchester Police Department arrested Sgt. Ryan Moan, 33, of Coventry, on Friday and slapped him with a handful of charges, including enticing a minor by computer.",
        "Manchester, CT cop found dead hours after being arrested": "A Connecticut cop was found dead on Friday, hours after he was arrested by his own police department and charged with enticing a minor and related crimes.",
        "Manchester's Matt Remillard Named To Connecticut Boxing Hall": "Manchester's Matt Remillard Named To Connecticut Boxing Hall - Manchester, CT - The Connecticut Boxing Hall of Fame induction gala is set to return to the Uncas Ballroom at Mohegan Sun on Nov. 18.",
        "Aer Lingus Swaps The Airbus A321LR For The A330 Between Manchester & New York": "The airline will redeploy the narrowbody aircraft on its transatlantic routes from Dublin to Hartford, Connecticut, and Cleveland, Ohio",
        "Recovery Connection Centers Set To Enter Connecticut - In Manchester": "Recovery Connection Centers Set To Enter Connecticut — In Manchester - Manchester, CT - A company that bills itself as \"the leading Suboxone treatment organization\" is poised to enter Connecticut.",
        "Watch: Connecticut teacher rescues unconscious driver from burning car": "Manchester Fire Rescue EMS says Heather Sica Leonard, a teacher at Illing Middle School in Manchester, almost certainly saved the driver’s life.",
        "Middle school teacher pulls driver with physical disability from burning van": "A Manchester middle school teacher saved a driver with a physical disability from a car fire, Connecticut police said.",
        "Manchester Road Race 2022: Division Winners, Area Town Bragging Rights": "Manchester Road Race 2022: Division Winners, Area Town Bragging Rights - Across Connecticut, CT - Division winners of the 86th Manchester Road Race, plus the first male and female finishers from Hartford and Tolland County Patch towns.",
        "State Police Dispatcher Caught In Manchester Drug Sting, Now On Leave": "State Police Dispatcher Caught In Manchester Drug Sting, Now On Leave - Manchester, CT - A dispatcher for the Connecticut State Police was arrested in a drug sting in Manchester, authorities said.",
        "August Air Conditioner Search - Which North Central CT Town Had It?": "August Air Conditioner Search — Which North Central CT Town Had It? - Manchester, CT - The search was on Tuesday for a particular air conditioning unit in north central Connecticut."
      }
    }
  ]
}